#pragma once
#include "headfile.h"
void Gameboard_debugout(int** s);
//-------------------------------------------------------------------------------------------------------------------
// 函数简介     输出游戏内盘函数
// 参数说明     s-游戏盘头地址
// 返回参数     无
// 使用示例     
// 备注信息		调试用显示内盘函数
//-------------------------------------------------------------------------------------------------------------------
void Gameboard_debugout(int**s)
{
	int i, j;
	for (i = 1; i < Row+1; i++)
	{
		for (j = 1; j < Col+1; j++)
		{
			printf("%d ",s[i][j]);
		}
		printf("\n");
	}
}